In [2]:
import pandas as pd
import numpy as np

# Jupyter 参数设置
# 导入设置后， 在一个cell 可以输出多个值
# 就没有必要用不同的cell去运行
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

Pandas 的两种数据结构 `Series` 和 `DataFrame`
## Series

In [7]:
from pandas import Series

In [8]:
tmp1 = Series(['this', 'is', 'tmp'])
tmp1

tmp2 = Series(['test', 'file'], index= ['a', 'b'])
tmp2

0    this
1      is
2     tmp
dtype: object

a    test
b    file
dtype: object

In [9]:
tmp2['a']

'test'

也可以通过字典来创建Series

In [10]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
tmp3 = pd.Series(sdata)
tmp3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

## DataFrame

In [11]:
from pandas import DataFrame

### DataFrame 导入数据与导出数据
DataFrame 可以从很多种数据中导入数据，比如说可以从excel、json、dict、list、Series 等等数据格式中导入数据。最常用的几个导入数据的命令如下：
```python
pd.read_csv(filename)：从CSV文件导入数据
pd.read_table(filename)：从限定分隔符的文本文件导入数据
pd.read_excel(filename)：从Excel文件导入数据
pd.read_sql(query, connection_object)：从SQL表/库导入数据
pd.read_json(json_string)：从JSON格式的字符串导入数据
pd.read_html(url)：解析URL、字符串或者HTML文件，抽取其中的tables表格
pd.read_clipboard()：从你的粘贴板获取内容，并传给read_table()
pd.DataFrame(dict)：从字典对象导入数据，Key是列名，Value是数据
```

In [93]:
# 从字典里导入数据
print('从字典里导入数据')
dict_data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.0]}
df1 = pd.DataFrame(dict_data, columns = ['year', 'state', 'pop'])
df1

print('从json中导入数据')
# 从json中导入数据
df2 = pd.read_json('pd_data/tmp.json')
df2

print('从csv中导入数据')
# 从csv中导入数据
df3 = pd.read_csv('pd_data/tmp.csv')

# df3 = df3.set_index('人物')
df3.loc[:, ]

从字典里导入数据

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

从json中导入数据

                            person_1 person_2 person_3
music                    [pop, rock]  [dance]   [jazz]
musical_instruction  [paino, guitar]      NaN      NaN

从csv中导入数据

        人物    爱好  喜欢吃什么
0  person1  打羽毛球  火锅，川菜
1  person2    睡觉    广东菜

In [13]:
### 选取其中一列
df1['state']

### 选取行和列
df1[:3]['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0    Ohio
1    Ohio
2    Ohio
Name: state, dtype: object

#### 导出数据

In [101]:
df1[df1.loc[:,'state']=='Ohio']

   year state  pop
0  2000  Ohio  1.5
1  2001  Ohio  1.7
2  2002  Ohio  3.6

In [103]:
df1[df1.loc[:,'state']=='Ohio'].to_pickle('pd_data/df1.pickle')

### 基础属性

In [14]:
df1.shape
df1.dtypes
df1.ndim
df1.index
df1.columns
df1.values

(6, 3)

year       int64
state     object
pop      float64
dtype: object

2

RangeIndex(start=0, stop=6, step=1)

Index(['year', 'state', 'pop'], dtype='object')

array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.0]], dtype=object)

### 整体情况

In [15]:
df1.head(3)
df1.tail(3)
df1.info()
df1.describe()

   year state  pop
0  2000  Ohio  1.5
1  2001  Ohio  1.7
2  2002  Ohio  3.6

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6 non-null      int64
 1   state   6 non-null      object
 2   pop     6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.516667
std       1.048809  0.808497
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  2.975000
max    2003.000000  3.600000

### 检索数据
检索数据有以下三种方式 `loc`， `iloc`，`boolean`。
`loc`与`iloc`的微小差别，从以下例子可以看出细小差别。

冒号选择的数据在`loc`里面是闭合的（即会选择冒号后面的数据）

```python
# select by position: iloc
df.iloc[ ] #  行列的查找都智能用他们的序数

# mixed selection 
df.loc[ ]  # mix， 行row的选择可以用序数也可以用行的名称； 列column的查找智能用列的名字！

# boolean indexing
'boolaen'方法更多是筛选数据！。非常好用。
df[df>=3] # 选出df中大于3的数据
```

In [16]:
df1

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

In [17]:
df1.loc[0:4, ['year','pop']] # 从0到4 [0,4] 来选择行， loc用括号是闭合的
df1.iloc[0:4, 0:2] # 从[0,4)来选择行   iloc来选择是开的 !

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada

#### 布尔索引

In [18]:
# 用条件来检索，筛选出pop 列中大于3的数据
# & 且
# ｜ 或
df1
df1[(df1.loc[:,'pop'] >= 2)&(df1.loc[:,'state']=='Nevada')]

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

In [19]:
# 以下为扩展知识
# 用条件来检索，筛选出state列中 字符长度大于4的数据
df1[df1.loc[:,'state'].str.len() >4] 
df1.loc[:,'state'].apply(lambda x : len(x) > 4)

   year   state  pop
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.0

0    False
1    False
2    False
3     True
4     True
5     True
Name: state, dtype: bool

### 数据筛选

In [20]:
df1.sort_values(by = 'pop', ascending=False)

   year   state  pop
2  2002    Ohio  3.6
5  2003  Nevada  3.0
4  2002  Nevada  2.9
3  2001  Nevada  2.4
1  2001    Ohio  1.7
0  2000    Ohio  1.5

In [21]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [22]:
df1['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [ ]:
M

## 数据处理

### 缺数据处理
有些数据是`0`， 有些是`nan` nan一般都是要处理的。

In [70]:
tmp_df1 = DataFrame(np.arange(12).reshape(4,3))
tmp_df1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [71]:
tmp_df1.iloc[0,1] = np.nan

In [72]:
tmp_df1

   0     1   2
0  0   NaN   2
1  3   4.0   5
2  6   7.0   8
3  9  10.0  11

In [75]:
tmp_df1.dropna(axis=0, how='all')
# how 可以选择两个参数， 'all' 'any' how = {'any', 'all'}
# all 是所有的行或者列都为空则除掉
# any 是任意一行或者任何一列其中一个值为空则删除

   0     1   2
0  0   NaN   2
1  3   4.0   5
2  6   7.0   8
3  9  10.0  11

In [76]:
tmp_df1.dropna(axis=0, how = 'any')

   0     1   2
1  3   4.0   5
2  6   7.0   8
3  9  10.0  11

#### 填入nan的值

In [78]:
tmp_df1.fillna(value=999)

   0      1   2
0  0  999.0   2
1  3    4.0   5
2  6    7.0   8
3  9   10.0  11

In [79]:
tmp_df1

   0     1   2
0  0   NaN   2
1  3   4.0   5
2  6   7.0   8
3  9  10.0  11

In [87]:
tmp_df1.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2  False  False  False
3  False  False  False

## 数据合并
`concat` 和 `merge` 方法

### Concat 方法
只是在原有数据中添加数据，如果有相同index，可能会出现相同index的行。

In [106]:
con_df1 = pd.DataFrame(np.ones((3,4)) * 0, columns = ['a','b','c','d'])
con_df2 = pd.DataFrame(np.ones((3,4)) * 1, columns = ['a','b','c','d'])
con_df3 = pd.DataFrame(np.ones((3,4)) * 2, columns = ['a','b','c','d'])

In [135]:
pd.concat([con_df1,con_df2,con_df3], axis=0)

# 加入ignore_index=True 参数后, 会对index进行重新排列
pd.concat([con_df1,con_df2,con_df3], axis=0, ignore_index=True)

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  NaN
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
0  NaN  1.0  1.0  1.0  1.0
1  NaN  1.0  1.0  1.0  1.0
2  NaN  1.0  1.0  1.0  1.0
0  2.0  2.0  2.0  2.0  NaN
1  2.0  2.0  2.0  2.0  NaN
2  2.0  2.0  2.0  2.0  NaN

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  NaN
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
3  NaN  1.0  1.0  1.0  1.0
4  NaN  1.0  1.0  1.0  1.0
5  NaN  1.0  1.0  1.0  1.0
6  2.0  2.0  2.0  2.0  NaN
7  2.0  2.0  2.0  2.0  NaN
8  2.0  2.0  2.0  2.0  NaN

In [142]:
# axis=1 对列进行合并，有重复的列出现
pd_cat = pd.concat([con_df1,con_df2,con_df3], axis=1)

pd_cat

pd_cat['b']

     a    b    c    d    b    c    d    e    a    b    c    d
0  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0
1  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0

     b    b    b
0  0.0  1.0  2.0
1  0.0  1.0  2.0
2  0.0  1.0  2.0

In [115]:
con_df1 = pd.DataFrame(np.ones((3,4)) * 0, columns = ['a','b','c','d'])
con_df2 = pd.DataFrame(np.ones((3,4)) * 1, columns = ['b','c','d','e'])

In [118]:
con_df1
con_df2

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0

     b    c    d    e
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

#### join 参数
`join = ['inner', 'outer']` 参数， inner只合并共同的行/列  
outer可以合并不同的行/列

In [121]:
# join ['inner', 'outer']
pd.concat([con_df1,con_df2], axis = 0, join='inner') # 只对其共同列/行合并成一个dataframe

     b    c    d
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [147]:
pd.concat([con_df1,con_df2], axis = 0, join='outer') # 不同行也可以对其合并成一个dataframe

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  NaN
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
0  NaN  1.0  1.0  1.0  1.0
1  NaN  1.0  1.0  1.0  1.0
2  NaN  1.0  1.0  1.0  1.0

### DataFrame.append() 方法

dataframe添加Series

In [125]:
S1 = pd.Series([1,2,3,4],index = ['a','b','c','d'])

In [127]:
con_df1.append(S1, ignore_index= True)

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  2.0  3.0  4.0

dataframe 添加dataframe

In [123]:
con_df1.append(con_df2)

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  NaN
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
0  NaN  1.0  1.0  1.0  1.0
1  NaN  1.0  1.0  1.0  1.0
2  NaN  1.0  1.0  1.0  1.0

### Merge 方法

#### 通过dataframe里面的key来融合不同的dataframe

In [163]:
# merging two df by key/keys. (may be used in database)
# simple example 通过一个key来融合
left = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
right = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

res = pd.merge(left, right, on='key')
print(res)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [164]:
# 用两个key来融合
# consider two keys
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

res = pd.merge(
    left, right, on=['key1', 'key2'], how='inner')  # default for how='inner'
print(res)
# how = ['left', 'right', 'outer', 'inner']
res = pd.merge(left, right, on=['key1', 'key2'], how='left')
print(res)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2
  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [175]:
# 设置 indicator 参数，可以调整 indicator column 的名字
# indicator column 可以知道融合后的数据哪一列存在
df1 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1':[1,2,1],'col_right':[2,2,2]})

res = pd.merge(df1, df2, on='col1', how='outer', indicator=True)
res

# give the indicator a custom name
res = pd.merge(df1, df2, on='col1', how='outer', indicator='indicator_column')
res

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     1        b        2.0        both
3     2      NaN        2.0  right_only

   col1 col_left  col_right indicator_column
0     0        a        NaN        left_only
1     1        b        2.0             both
2     1        b        2.0             both
3     2      NaN        2.0       right_only

#### 通过index来合并

In [174]:
# merged by index
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                                  'B': ['B0', 'B1', 'B2']},
                                  index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                                     'D': ['D0', 'D2', 'D3']},
                                      index=['K0', 'K2', 'K3'])

# left_index and right_index
res = pd.merge(left, right, left_index=True, right_index=True, how='outer')
res

res = pd.merge(left, right, left_index=True, right_index=True, how='inner')
res

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [176]:
# handle overlapping

boys = pd.DataFrame({'k': ['K0', 'K1', 'K2'], 'age': [1, 2, 3]})
girls = pd.DataFrame({'k': ['K0', 'K0', 'K3'], 'age': [4, 5, 6]})
res = pd.merge(boys, girls, on='k', suffixes=['_boy', '_girl'], how='inner')
res

    k  age_boy  age_girl
0  K0        1         4
1  K0        1         5